OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f65k22.h
/*
 * This declarations of the PIC18F65K22 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:32 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC18F65K22_H__
#define __PIC18F65K22_H__

//==============================================================================

//==============================================================================
//
//	Register Definitions
//
//==============================================================================


//==============================================================================
//        PMD3 Bits

extern __at(0x0F16) __sfr PMD3;

typedef struct
  {
  unsigned                      : 1;
  unsigned CCP4MD               : 1;
  unsigned CCP5MD               : 1;
  unsigned CCP6MD               : 1;
  unsigned CCP7MD               : 1;
  unsigned CCP8MD               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PMD3bits_t;

extern __at(0x0F16) volatile __PMD3bits_t PMD3bits;

#define _CCP4MD                 0x02
#define _CCP5MD                 0x04
#define _CCP6MD                 0x08
#define _CCP7MD                 0x10
#define _CCP8MD                 0x20

//==============================================================================


//==============================================================================
//        PMD2 Bits

extern __at(0x0F17) __sfr PMD2;

typedef struct
  {
  unsigned CMP1MD               : 1;
  unsigned CMP2MD               : 1;
  unsigned CMP3MD               : 1;
  unsigned TMR5MD               : 1;
  unsigned TMR6MD               : 1;
  unsigned                      : 1;
  unsigned TMR8MD               : 1;
  unsigned                      : 1;
  } __PMD2bits_t;

extern __at(0x0F17) volatile __PMD2bits_t PMD2bits;

#define _CMP1MD                 0x01
#define _CMP2MD                 0x02
#define _CMP3MD                 0x04
#define _TMR5MD                 0x08
#define _TMR6MD                 0x10
#define _TMR8MD                 0x40

//==============================================================================


//==============================================================================
//        PMD1 Bits

extern __at(0x0F18) __sfr PMD1;

typedef struct
  {
  unsigned                      : 1;
  unsigned TMR1MD               : 1;
  unsigned TMR2MD               : 1;
  unsigned TMR3MD               : 1;
  unsigned TMR4MD               : 1;
  unsigned RTCCMD               : 1;
  unsigned CTMUMD               : 1;
  unsigned PSPMD                : 1;
  } __PMD1bits_t;

extern __at(0x0F18) volatile __PMD1bits_t PMD1bits;

#define _TMR1MD                 0x02
#define _TMR2MD                 0x04
#define _TMR3MD                 0x08
#define _TMR4MD                 0x10
#define _RTCCMD                 0x20
#define _CTMUMD                 0x40
#define _PSPMD                  0x80

//==============================================================================


//==============================================================================
//        PMD0 Bits

extern __at(0x0F19) __sfr PMD0;

typedef struct
  {
  unsigned ADCMD                : 1;
  unsigned SSP1MD               : 1;
  unsigned SSP2MD               : 1;
  unsigned UART1MD              : 1;
  unsigned UART2MD              : 1;
  unsigned CCP1MD               : 1;
  unsigned CCP2MD               : 1;
  unsigned CCP3MD               : 1;
  } __PMD0bits_t;

extern __at(0x0F19) volatile __PMD0bits_t PMD0bits;

#define _ADCMD                  0x01
#define _SSP1MD                 0x02
#define _SSP2MD                 0x04
#define _UART1MD                0x08
#define _UART2MD                0x10
#define _CCP1MD                 0x20
#define _CCP2MD                 0x40
#define _CCP3MD                 0x80

//==============================================================================


//==============================================================================
//        PSTR3CON Bits

extern __at(0x0F1A) __sfr PSTR3CON;

typedef union
  {
  struct
    {
    unsigned STRA               : 1;
    unsigned STRB               : 1;
    unsigned STRC               : 1;
    unsigned STRD               : 1;
    unsigned STRSYNC            : 1;
    unsigned                    : 1;
    unsigned CMPL0              : 1;
    unsigned CMPL1              : 1;
    };

  struct
    {
    unsigned                    : 6;
    unsigned CMPL               : 2;
    };
  } __PSTR3CONbits_t;

extern __at(0x0F1A) volatile __PSTR3CONbits_t PSTR3CONbits;

#define _PSTR3CON_STRA          0x01
#define _PSTR3CON_STRB          0x02
#define _PSTR3CON_STRC          0x04
#define _PSTR3CON_STRD          0x08
#define _PSTR3CON_STRSYNC       0x10
#define _PSTR3CON_CMPL0         0x40
#define _PSTR3CON_CMPL1         0x80

//==============================================================================


//==============================================================================
//        PSTR2CON Bits

extern __at(0x0F1B) __sfr PSTR2CON;

typedef union
  {
  struct
    {
    unsigned STRA               : 1;
    unsigned STRB               : 1;
    unsigned STRC               : 1;
    unsigned STRD               : 1;
    unsigned STRSYNC            : 1;
    unsigned                    : 1;
    unsigned CMPL0              : 1;
    unsigned CMPL1              : 1;
    };

  struct
    {
    unsigned                    : 6;
    unsigned CMPL               : 2;
    };
  } __PSTR2CONbits_t;

extern __at(0x0F1B) volatile __PSTR2CONbits_t PSTR2CONbits;

#define _PSTR2CON_STRA          0x01
#define _PSTR2CON_STRB          0x02
#define _PSTR2CON_STRC          0x04
#define _PSTR2CON_STRD          0x08
#define _PSTR2CON_STRSYNC       0x10
#define _PSTR2CON_CMPL0         0x40
#define _PSTR2CON_CMPL1         0x80

//==============================================================================

extern __at(0x0F1C) __sfr TXREG2;
extern __at(0x0F1D) __sfr RCREG2;
extern __at(0x0F1E) __sfr SPBRG2;
extern __at(0x0F1F) __sfr SPBRGH2;

//==============================================================================
//        BAUDCON2 Bits

extern __at(0x0F20) __sfr BAUDCON2;

typedef struct
  {
  unsigned ABDEN                : 1;
  unsigned WUE                  : 1;
  unsigned                      : 1;
  unsigned BRG16                : 1;
  unsigned TXCKP                : 1;
  unsigned RXDTP                : 1;
  unsigned RCIDL                : 1;
  unsigned ABDOVF               : 1;
  } __BAUDCON2bits_t;

extern __at(0x0F20) volatile __BAUDCON2bits_t BAUDCON2bits;

#define _BAUDCON2_ABDEN         0x01
#define _BAUDCON2_WUE           0x02
#define _BAUDCON2_BRG16         0x08
#define _BAUDCON2_TXCKP         0x10
#define _BAUDCON2_RXDTP         0x20
#define _BAUDCON2_RCIDL         0x40
#define _BAUDCON2_ABDOVF        0x80

//==============================================================================


//==============================================================================
//        TXSTA2 Bits

extern __at(0x0F21) __sfr TXSTA2;

typedef union
  {
  struct
    {
    unsigned TX9D               : 1;
    unsigned TRMT               : 1;
    unsigned BRGH               : 1;
    unsigned SENDB              : 1;
    unsigned SYNC               : 1;
    unsigned TXEN               : 1;
    unsigned TX9                : 1;
    unsigned CSRC               : 1;
    };

  struct
    {
    unsigned TX9D2              : 1;
    unsigned TRMT2              : 1;
    unsigned BRGH2              : 1;
    unsigned SENDB2             : 1;
    unsigned SYNC2              : 1;
    unsigned TXEN2              : 1;
    unsigned TX92               : 1;
    unsigned CSRC2              : 1;
    };
  } __TXSTA2bits_t;

